proxymock/snapshot-b58cc0c3-9ec8-423b-bf33-883c99a655ae/www.dataaccess.com/2025-08-08_19-41-54.158963865Z.md

### RESPONSE (MOCK) ###
```
Access-Control-Allow-Origin: *
Cache-Control: private\, max-age=0
Content-Security-Policy: default-src * data: 'unsafe-inline' 'unsafe-eval'; form-action 'self'; frame-ancestors 'self';
Content-Type: text/xml; charset=utf-8
Date: Fri\, 08 Aug 2025 19:41:54 GMT
Permissions-Policy: interest-cohort=(); fullscreen=(self)
Referrer-Policy: strict-origin-when-cross-origin
Server: Server
Strict-Transport-Security: max-age=15768000;includeSubdomains
Tdm-Reservation: 1
Web-Service: DataFlex 19.1
X-Content-Type-Options: nosniff
X-Powered-By: ASP.NET
X-Robots-Tag: noai\, noimageai
```

```
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <m:NumberToWordsResponse xmlns:m="http://www.dataaccess.com/webservicesserver/">
      <m:NumberToWordsResult>one hundred and twenty three </m:NumberToWordsResult>
    </m:NumberToWordsResponse>
  </soap:Body>
</soap:Envelope>
```

### SIGNATURE ###
```
http:host is www.dataaccess.com
http:method is POST
http:queryparams is -NONE-
http:requestBodyXML is <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.dataaccess.com/webservicesserver/"><SOAP-ENV:Header/><SOAP-ENV:Body><web:NumberToWords><web:ubiNum>123</web:ubiNum></web:NumberToWords></SOAP-ENV:Body></SOAP-ENV:Envelope>
http:url is /webservicesserver/NumberConversion.wso
```

### REQUEST ###
```
POST https://www.dataaccess.com:443/webservicesserver/NumberConversion.wso HTTP/1.1
Accept: text/xml\, text/html\, image/gif\, image/jpeg\, *; q=.2\, */*; q=.2
Authorization: REDACTED-e3b0c44298fc1c149afb
Cache-Control: no-cache
Connection: keep-alive
Content-Type: text/xml; charset=utf-8
Host: www.dataaccess.com
Pragma: no-cache
User-Agent: Java/17.0.16
```

```
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.dataaccess.com/webservicesserver/"><SOAP-ENV:Header/><SOAP-ENV:Body><web:NumberToWords><web:ubiNum>123</web:ubiNum></web:NumberToWords></SOAP-ENV:Body></SOAP-ENV:Envelope>
```

### METADATA ###
```
direction: OUT
uuid: 9bec158f-c672-4e70-95f7-8155fbab5db5
ts: 2025-08-08T19:41:54.158963865Z
duration: 27ms
tags: captureMode=proxy, k8sAppLabel=newboots-server, k8sAppPodName=newboots-server-55d8b59f9-btw5x, k8sAppPodNamespace=default, k8sClusterName=colimaken, proxyId=newboots-server-55d8b59f9-btw5x, proxyProtocol=, proxyType=transparent, proxyVersion=v2.3.661, sequence=231, source=goproxy, trimmed=
```

### INTERNAL - DO NOT MODIFY ###
```
json: {"msgType":"rrpair","resource":"newboots-server","ts":"2025-08-08T19:41:54.158963865Z","isTls":true,"l7protocol":"https","duration":27,"tags":{"captureMode":"proxy","k8sAppLabel":"newboots-server","k8sAppPodName":"newboots-server-55d8b59f9-btw5x","k8sAppPodNamespace":"default","k8sClusterName":"colimaken","proxyId":"newboots-server-55d8b59f9-btw5x","proxyLocation":"out","proxyProtocol":"","proxyType":"transparent","proxyVersion":"v2.3.661","sequence":"231","source":"goproxy","trimmed":""},"uuid":"m+wVj8ZyTnCV94FV+6tdtQ==","direction":"OUT","cluster":"colimaken","namespace":"default","service":"newboots-server","tech":"XML","network_address":"www.dataaccess.com:443","command":"POST","location":"/webservicesserver/NumberConversion.wso","status":"200","dlpModified":true,"http":{"req":{"url":"/webservicesserver/NumberConversion.wso","uri":"/webservicesserver/NumberConversion.wso","version":"1.1","method":"POST","host":"www.dataaccess.com","headers":{"Accept":["text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2"],"Authorization":["REDACTED-e3b0c44298fc1c149afb"],"Cache-Control":["no-cache"],"Connection":["keep-alive"],"Content-Length":["271"],"Content-Type":["text/xml; charset=utf-8"],"Host":["www.dataaccess.com"],"Pragma":["no-cache"],"User-Agent":["Java/17.0.16"]},"bodyBase64":"PFNPQVAtRU5WOkVudmVsb3BlIHhtbG5zOlNPQVAtRU5WPSJodHRwOi8vc2NoZW1hcy54bWxzb2FwLm9yZy9zb2FwL2VudmVsb3BlLyIgeG1sbnM6d2ViPSJodHRwOi8vd3d3LmRhdGFhY2Nlc3MuY29tL3dlYnNlcnZpY2Vzc2VydmVyLyI+PFNPQVAtRU5WOkhlYWRlci8+PFNPQVAtRU5WOkJvZHk+PHdlYjpOdW1iZXJUb1dvcmRzPjx3ZWI6dWJpTnVtPjEyMzwvd2ViOnViaU51bT48L3dlYjpOdW1iZXJUb1dvcmRzPjwvU09BUC1FTlY6Qm9keT48L1NPQVAtRU5WOkVudmVsb3BlPg==","body":"<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:web=\"http://www.dataaccess.com/webservicesserver/\"><SOAP-ENV:Header/><SOAP-ENV:Body><web:NumberToWords><web:ubiNum>123</web:ubiNum></web:NumberToWords></SOAP-ENV:Body></SOAP-ENV:Envelope>"},"res":{"contentType":"text/xml; charset=utf-8","statusCode":200,"statusMessage":"200 OK","headers":{"Access-Control-Allow-Origin":["*"],"Cache-Control":["private, max-age=0"],"Content-Length":["361"],"Content-Security-Policy":["default-src * data: 'unsafe-inline' 'unsafe-eval'; form-action 'self'; frame-ancestors 'self';"],"Content-Type":["text/xml; charset=utf-8"],"Date":["Fri, 08 Aug 2025 19:41:54 GMT"],"Permissions-Policy":["interest-cohort=(); fullscreen=(self)"],"Referrer-Policy":["strict-origin-when-cross-origin"],"Server":["Server"],"Strict-Transport-Security":["max-age=15768000;includeSubdomains"],"Tdm-Reservation":["1"],"Web-Service":["DataFlex 19.1"],"X-Content-Type-Options":["nosniff"],"X-Powered-By":["ASP.NET"],"X-Robots-Tag":["noai, noimageai"]},"bodyBase64":"PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0idXRmLTgiPz4NCjxzb2FwOkVudmVsb3BlIHhtbG5zOnNvYXA9Imh0dHA6Ly9zY2hlbWFzLnhtbHNvYXAub3JnL3NvYXAvZW52ZWxvcGUvIj4NCiAgPHNvYXA6Qm9keT4NCiAgICA8bTpOdW1iZXJUb1dvcmRzUmVzcG9uc2UgeG1sbnM6bT0iaHR0cDovL3d3dy5kYXRhYWNjZXNzLmNvbS93ZWJzZXJ2aWNlc3NlcnZlci8iPg0KICAgICAgPG06TnVtYmVyVG9Xb3Jkc1Jlc3VsdD5vbmUgaHVuZHJlZCBhbmQgdHdlbnR5IHRocmVlIDwvbTpOdW1iZXJUb1dvcmRzUmVzdWx0Pg0KICAgIDwvbTpOdW1iZXJUb1dvcmRzUmVzcG9uc2U+DQogIDwvc29hcDpCb2R5Pg0KPC9zb2FwOkVudmVsb3BlPg==","body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <m:NumberToWordsResponse xmlns:m=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <m:NumberToWordsResult>one hundred and twenty three </m:NumberToWordsResult>\r\n    </m:NumberToWordsResponse>\r\n  </soap:Body>\r\n</soap:Envelope>"}},"tokenList":{"JWT:www.dataaccess.com":{"id":"JWT:www.dataaccess.com","tokens":[{"uuid":"m+wVj8ZyTnCV94FV+6tdtQ==","token":{"location":"http.req.headers.Host[0]","pattern":"DATA_PATTERN_JWT","replacementValue":"d3d3LmRhdGFhY2Nlc3MuY29t"}}]},"UNRECOGNIZED:REDACTED-e3b0c44298fc1c149afb":{"id":"UNRECOGNIZED:REDACTED-e3b0c44298fc1c149afb","tokens":[{"uuid":"m+wVj8ZyTnCV94FV+6tdtQ==","token":{"replacementValue":"UkVEQUNURUQtZTNiMGM0NDI5OGZjMWMxNDlhZmI="}},{"uuid":"m+wVj8ZyTnCV94FV+6tdtQ==","token":{"location":"http.req.headers.Authorization[0]","replacementValue":"UkVEQUNURUQtZTNiMGM0NDI5OGZjMWMxNDlhZmI="}}]},"URI:*":{"id":"URI:*","tokens":[{"uuid":"m+wVj8ZyTnCV94FV+6tdtQ==","token":{"location":"http.req.headers.Access-Control-Allow-Origin[0]","pattern":"DATA_PATTERN_URI","replacementValue":"Kg=="}},{"uuid":"m+wVj8ZyTnCV94FV+6tdtQ==","token":{"location":"http.res.headers.Access-Control-Allow-Origin[0]","pattern":"DATA_PATTERN_URI","replacementValue":"Kg=="}}]}},"signature":{"http:host":"d3d3LmRhdGFhY2Nlc3MuY29t","http:method":"UE9TVA==","http:queryparams":"","http:requestBodyXML":"PFNPQVAtRU5WOkVudmVsb3BlIHhtbG5zOlNPQVAtRU5WPSJodHRwOi8vc2NoZW1hcy54bWxzb2FwLm9yZy9zb2FwL2VudmVsb3BlLyIgeG1sbnM6d2ViPSJodHRwOi8vd3d3LmRhdGFhY2Nlc3MuY29tL3dlYnNlcnZpY2Vzc2VydmVyLyI+PFNPQVAtRU5WOkhlYWRlci8+PFNPQVAtRU5WOkJvZHk+PHdlYjpOdW1iZXJUb1dvcmRzPjx3ZWI6dWJpTnVtPjEyMzwvd2ViOnViaU51bT48L3dlYjpOdW1iZXJUb1dvcmRzPjwvU09BUC1FTlY6Qm9keT48L1NPQVAtRU5WOkVudmVsb3BlPg==","http:url":"L3dlYnNlcnZpY2Vzc2VydmVyL051bWJlckNvbnZlcnNpb24ud3Nv"},"netinfo":{"id":"26","startTime":"2025-08-08T19:41:54.158811948Z","downstream":{"established":"2025-08-08T19:41:54.061723782Z","ipAddress":"10.42.0.61","port":39538,"bytesSent":"579"},"upstream":{"established":"2025-08-08T19:41:54.086445085Z","ipAddress":"52.7.155.169","port":443,"hostname":"www.dataaccess.com","bytesSent":"988"}},"mutableSignature":{"http:host":"www.dataaccess.com","http:method":"POST","http:queryparams":"","http:requestBodyXML":"<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:web=\"http://www.dataaccess.com/webservicesserver/\"><SOAP-ENV:Header/><SOAP-ENV:Body><web:NumberToWords><web:ubiNum>123</web:ubiNum></web:NumberToWords></SOAP-ENV:Body></SOAP-ENV:Envelope>","http:url":"/webservicesserver/NumberConversion.wso"}}
```
